apiproxy/policies/BillUser-build-soap.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<AssignMessage async="false" continueOnError="true" enabled="true" name="BillUser-build-soap">
    <DisplayName>BillUser Build SOAP</DisplayName>
    <Add>
        <Headers>
            <Header name="SOAPAction"/>
        </Headers>
    </Add>
    <Set>
        <Headers>
            <Header name="Content-Type">text/xml; charset=utf-8</Header>
        </Headers>
        <Payload contentType="text/xml">
<s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/">  <s11:Header>    <ns:RequesterCredentials xmlns:ns="urn:ebay:api:PayPalAPI">
<!-- optional -->      <ns:eBayAuthToken xmlns:ns="urn:ebay:apis:eBLBaseComponents">{ns:eBayAuthToken}</ns:eBayAuthToken>
<!-- optional -->      <ns:HardExpirationWarning xmlns:ns="urn:ebay:apis:eBLBaseComponents">{ns:HardExpirationWarning}</ns:HardExpirationWarning>
<!-- optional -->      <ns:Credentials xmlns:ns="urn:ebay:apis:eBLBaseComponents">
<!-- optional -->        <ns:AppId>{ns:AppId}</ns:AppId>
<!-- optional -->        <ns:DevId>{ns:DevId}</ns:DevId>
<!-- optional -->        <ns:AuthCert>{ns:AuthCert}</ns:AuthCert>        <ns:Username>{ns:Username}</ns:Username>        <ns:Password>{ns:Password}</ns:Password>
<!-- optional -->        <ns:Signature>{ns:Signature}</ns:Signature>
<!-- optional -->        <ns:Subject>{ns:Subject}</ns:Subject>
<!-- optional -->        <ns:AuthToken>{ns:AuthToken}</ns:AuthToken>      </ns:Credentials>    </ns:RequesterCredentials>  </s11:Header>  <s11:Body>    <ns:BillUserReq xmlns:ns="urn:ebay:api:PayPalAPI">      <ns:BillUserRequest>
<!-- from 0 to unbounded -->
<!-- possible value: ReturnAll, possible value: ItemReturnDescription, possible value: ItemReturnAttributes -->        <ns:DetailLevel xmlns:ns="urn:ebay:apis:eBLBaseComponents">{ns:DetailLevel}</ns:DetailLevel>
<!-- optional -->        <ns:ErrorLanguage xmlns:ns="urn:ebay:apis:eBLBaseComponents">{ns:ErrorLanguage}</ns:ErrorLanguage>        <ns:Version xmlns:ns="urn:ebay:apis:eBLBaseComponents">{ns:Version}</ns:Version>
<!-- This element can be extended by any element from ##local namespace -->        <ns:MerchantPullPaymentDetails xmlns:ns="urn:ebay:apis:eBLBaseComponents">          <ns:Amount xmlns:ns="urn:ebay:apis:CoreComponentTypes" ns:currencyID="{ns:currencyID}">{ns:Amount}</ns:Amount>          <ns:MpID>{ns:MpID}</ns:MpID>
<!-- optional -->
<!-- possible value: Any, possible value: InstantOnly, possible value: EcheckOnly -->          <ns:PaymentType>{ns:PaymentType}</ns:PaymentType>
<!-- optional -->          <ns:Memo>{ns:Memo}</ns:Memo>
<!-- optional -->          <ns:EmailSubject>{ns:EmailSubject}</ns:EmailSubject>
<!-- optional -->          <ns:Tax xmlns:ns="urn:ebay:apis:CoreComponentTypes" ns:currencyID="{ns:currencyID}">{ns:Tax}</ns:Tax>
<!-- optional -->          <ns:Shipping xmlns:ns="urn:ebay:apis:CoreComponentTypes" ns:currencyID="{ns:currencyID}">{ns:Shipping}</ns:Shipping>
<!-- optional -->          <ns:Handling xmlns:ns="urn:ebay:apis:CoreComponentTypes" ns:currencyID="{ns:currencyID}">{ns:Handling}</ns:Handling>
<!-- optional -->          <ns:ItemName>{ns:ItemName}</ns:ItemName>
<!-- optional -->          <ns:ItemNumber>{ns:ItemNumber}</ns:ItemNumber>
<!-- optional -->          <ns:Invoice>{ns:Invoice}</ns:Invoice>
<!-- optional -->          <ns:Custom>{ns:Custom}</ns:Custom>
<!-- optional -->          <ns:ButtonSource>{ns:ButtonSource}</ns:ButtonSource>
<!-- optional -->          <ns:SoftDescriptor>{ns:SoftDescriptor}</ns:SoftDescriptor>        </ns:MerchantPullPaymentDetails>
<!-- optional -->        <ns:ReturnFMFDetails>{ns:ReturnFMFDetails}</ns:ReturnFMFDetails>      </ns:BillUserRequest>    </ns:BillUserReq>  </s11:Body>
</s11:Envelope>
</Payload>
        <Verb>POST</Verb>
    </Set>
    <AssignVariable>
        <Name>forward.target.url</Name>
        <Value>https://api.sandbox.paypal.com/2.0/</Value>
    </AssignVariable>
    <IgnoreUnresolvedVariables>true</IgnoreUnresolvedVariables>
    <AssignTo createNew="false" transport="http" type="request"/>
</AssignMessage>
